## Pandas Tutorial_part8
**Pandas Merge:** is a way through which we can join two DataFrames.

In [1]:
import pandas as pd

In [2]:
df1=pd.DataFrame({
    "city": ["new yark", "chicago", "orlando"],
    "temperature": [33, 43, 38]
})
df1

       city  temperature
0  new yark           33
1   chicago           43
2   orlando           38

In [3]:
df2=pd.DataFrame({
    "city": ["new yark", "chicago", "orlando"],
    "humidity": [65, 68, 75]
})
df2

       city  humidity
0  new yark        65
1   chicago        68
2   orlando        75

In [5]:
# So now we want ot join the upper two DataFrames:
df=pd.merge(df1, df2, on="city")
df

       city  temperature  humidity
0  new yark           33        65
1   chicago           43        68
2   orlando           38        75

In [6]:
# Let's add 'baltimore' city with it's corresponding weather to df1:
df1=pd.DataFrame({
    "city": ["new yark", "chicago", "orlando", "baltimore"],
    "temperature": [33, 43, 38, 30]
})
df1

        city  temperature
0   new yark           33
1    chicago           43
2    orlando           38
3  baltimore           30

In [7]:
# Let's add 'san fransisco' city with it's corresponding humidity to df2:
df2=pd.DataFrame({
    "city": ["new yark", "chicago", "orlando", "san fransisco"],
    "humidity": [65, 68, 75, 70]
})
df2

            city  humidity
0       new yark        65
1        chicago        68
2        orlando        75
3  san fransisco        70

In [11]:
# Now if you see we have one different city per each DataFrame, so now again if we add them it will skip the the cities which are not common:
df=pd.merge(df1, df2, on="city")
df

       city  temperature  humidity
0  new yark           33        65
1   chicago           43        68
2   orlando           38        75

In [12]:
# Using (how='outer') parameter we can merge them:
# Outer means: we join these two DataFrames as outer join concept.
df=pd.merge(df1, df2, on="city", how="outer")
df

            city  temperature  humidity
0       new yark         33.0      65.0
1        chicago         43.0      68.0
2        orlando         38.0      75.0
3      baltimore         30.0       NaN
4  san fransisco          NaN      70.0

Basic join concepts is shown bellow:

![](db_joins.jpg)

In [13]:
# By default 'how' parameter is set ot 'inner':
df=pd.merge(df1, df2, on="city", how="inner")
df

       city  temperature  humidity
0  new yark           33        65
1   chicago           43        68
2   orlando           38        75

In [14]:
# We can use 'left join':
df=pd.merge(df1, df2, on="city", how="left")
df

        city  temperature  humidity
0   new yark           33      65.0
1    chicago           43      68.0
2    orlando           38      75.0
3  baltimore           30       NaN

In [15]:
# We can use 'right join':
df=pd.merge(df1, df2, on="city", how="right")
df

            city  temperature  humidity
0       new yark         33.0        65
1        chicago         43.0        68
2        orlando         38.0        75
3  san fransisco          NaN        70

In [17]:
# Through 'indicator' we can display that which city are related to which DataFrame:
df=pd.merge(df1, df2, on="city", how="outer", indicator=True)
df

            city  temperature  humidity      _merge
0       new yark         33.0      65.0        both
1        chicago         43.0      68.0        both
2        orlando         38.0      75.0        both
3      baltimore         30.0       NaN   left_only
4  san fransisco          NaN      70.0  right_only

In [18]:
# These were all about Pandas Merge, for more check Pandas documentation...